# This is Assignment 12 - Asha Karmakar

## Requirement 4

In [1]:
# Using the Planets dataset from Seaborn, determine the number of rows and columns in the dataset

import seaborn as sns
planets = sns.load_dataset('planets')
print ("rows:",planets.shape[0])
print ("columns:",planets.shape[1])

rows: 1035
columns: 6

## Requirement 5

In [2]:
# Use following seeds for RandomState()to demonstrate that the function returns the same random numbers for constant seeds:

import numpy as np, pandas as pd

# RandomState(42)
rng = np.random.RandomState(42)
nums = pd.Series(rng.rand(5))
print ("RandomState(42):", nums)

# RandomState(99)
rng = np.random.RandomState(99)
nums = pd.Series(rng.rand(5))
print ("\nRandomState(99):", nums)

# RandomState(42)
rng = np.random.RandomState(42)
nums = pd.Series(rng.rand(10))
print ("\nRandomState(42):", nums)

# RandomState(99)
rng = np.random.RandomState(99)
nums = pd.Series(rng.rand(10))
print ("\nRandomState(99):", nums)

RandomState(42): 0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

RandomState(99): 0    0.672279
1    0.488078
2    0.825495
3    0.031446
4    0.808050
dtype: float64

RandomState(42): 0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
5    0.155995
6    0.058084
7    0.866176
8    0.601115
9    0.708073
dtype: float64

RandomState(99): 0    0.672279
1    0.488078
2    0.825495
3    0.031446
4    0.808050
5    0.565617
6    0.297622
7    0.046696
8    0.990627
9    0.006826
dtype: float64

## Requirement 6

In [3]:
# Use rand(5) to produce the following dataframe. Naturally, values will vary.

rand_df = pd.DataFrame({'Texas': rng.rand(5),'Georgia': rng.rand(5),'Main': rng.rand(5)})
rand_df

      Texas   Georgia      Main
0  0.769793  0.395454  0.211687
1  0.746767  0.973956  0.554346
2  0.377439  0.524415  0.292269
3  0.494147  0.093613  0.816142
4  0.928948  0.813308  0.828043

## Requirement 7

In [4]:
# Output the common aggregates for the Pandas dataset dropping rows with missing values.

planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

## Requirement 8

In [6]:
# Output a list of the datasets that install with Seaborn.

five = sns.get_dataset_names()
five

['anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

## Requirement 9

In [7]:
# Output the top five rows of five Pandas datasets:

for d in five[1:10:2]:
    print ("\nDATASET:"+d)
    print (sns.load_dataset(d).head())

DATASET:attention
   Unnamed: 0  subject attention  solutions  score
0           0        1   divided          1    2.0
1           1        2   divided          1    3.0
2           2        3   divided          1    3.0
3           3        4   divided          1    5.0
4           4        5   divided          1    4.0

DATASET:car_crashes
   total  speeding  alcohol  not_distracted  no_previous  ins_premium  \
0   18.8     7.332    5.640          18.048       15.040       784.55
1   18.1     7.421    4.525          16.290       17.014      1053.48
2   18.6     6.510    5.208          15.624       17.856       899.47
3   22.4     4.032    5.824          21.056       21.280       827.34
4   12.0     4.200    3.360          10.920       10.680       878.41

   ins_losses abbrev
0      145.08     AL
1      133.93     AK
2      110.35     AZ
3      142.39     AR
4      165.63     CA

DATASET:dots
  align choice  time  coherence  firing_rate
0  dots     T1   -80        0.0    33.189967
1  dots     T1   -80        3.2    31.691726
2  dots     T1   -80        6.4    34.279840
3  dots     T1   -80       12.8    32.631874
4  dots     T1   -80       25.6    35.060487

DATASET:flights
   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

DATASET:gammas
   timepoint  ROI  subject  BOLD signal
0        0.0  IPS        0     0.513433
1        0.0  IPS        1    -0.414368
2        0.0  IPS        2     0.214695
3        0.0  IPS        3     0.814809
4        0.0  IPS        4    -0.894992

# Requirement 10

In [8]:
# Apply the describe() method to a planets.groupby() object.

planets.groupby('year').describe()

     number                                               orbital_period  \
      count      mean       std  min  25%  50%   75%  max          count
year
1989    1.0  1.000000       NaN  1.0  1.0  1.0  1.00  1.0            1.0
1992    2.0  3.000000  0.000000  3.0  3.0  3.0  3.00  3.0            2.0
1994    1.0  3.000000       NaN  3.0  3.0  3.0  3.00  3.0            1.0
1995    1.0  1.000000       NaN  1.0  1.0  1.0  1.00  1.0            1.0
1996    6.0  2.500000  1.760682  1.0  1.0  2.0  3.75  5.0            6.0
1997    1.0  1.000000       NaN  1.0  1.0  1.0  1.00  1.0            1.0
1998    5.0  2.200000  1.095445  1.0  2.0  2.0  2.00  4.0            5.0
1999   15.0  1.600000  1.055597  1.0  1.0  1.0  2.00  4.0           15.0
2000   16.0  1.687500  1.014479  1.0  1.0  1.0  2.00  4.0           16.0
2001   12.0  1.250000  0.621582  1.0  1.0  1.0  1.00  3.0           12.0
2002   32.0  1.437500  0.877588  1.0  1.0  1.0  2.00  5.0           32.0
2003   25.0  1.400000  0.645497  1.0  1.0  1.0  2.00  3.0           25.0
2004   26.0  1.576923  1.101747  1.0  1.0  1.0  2.00  5.0           22.0
2005   39.0  1.641026  1.063440  1.0  1.0  1.0  2.00  4.0           38.0
2006   31.0  1.387097  0.843699  1.0  1.0  1.0  1.00  4.0           28.0
2007   53.0  1.226415  0.697289  1.0  1.0  1.0  1.00  5.0           52.0
2008   74.0  1.621622  1.178607  1.0  1.0  1.0  2.00  6.0           69.0
2009   98.0  1.336735  0.624976  1.0  1.0  1.0  1.75  3.0           96.0
2010  102.0  1.892157  1.652522  1.0  1.0  1.0  2.00  6.0           96.0
2011  185.0  1.913514  1.199221  1.0  1.0  2.0  2.00  6.0          184.0
2012  140.0  1.842857  1.074702  1.0  1.0  2.0  2.00  6.0          132.0
2013  118.0  2.347458  1.716571  1.0  1.0  2.0  2.00  7.0          107.0
2014   52.0  2.250000  1.234710  1.0  1.0  2.0  3.00  5.0           51.0

                    ...     mass         distance                           \
              mean  ...      75%     max    count        mean          std
year                ...
1989     83.888000  ...  11.6800  11.680      1.0   40.570000          NaN
1992     45.901950  ...      NaN     NaN      0.0         NaN          NaN
1994     98.211400  ...      NaN     NaN      0.0         NaN          NaN
1995      4.230785  ...   0.4720   0.472      1.0   15.360000          NaN
1996    335.961656  ...   2.8725   3.900      6.0   15.866667     3.343703
1997     39.845000  ...   1.0400   1.040      1.0   17.430000          NaN
1998    114.310661  ...   2.2756   8.020      5.0   26.302000    16.855839
1999    552.280919  ...   4.0765   8.440     15.0   30.947333    14.447872
2000    540.945323  ...   3.2475  18.100     16.0   30.752500    18.042758
2001    735.304392  ...   5.0450  10.350     12.0   36.531667    18.152531
2002    971.834186  ...   4.9500  17.400     31.0   44.396129    23.294079
2003   2182.036515  ...   4.9475  18.370     24.0   43.085417    29.760336
2004    538.038556  ...   2.2700   3.690     23.0  184.777826   518.812277
2005    741.982000  ...   2.5125  14.000     37.0   46.484324    48.886078
2006  26762.097097  ...   1.9500   7.600     28.0  660.228929  2214.828664
2007    363.759133  ...   3.1775  19.800     45.0  162.656000   300.327248
2008   9394.701194  ...   4.9100  25.000     64.0   98.680312   115.811291
2009   1346.422722  ...   4.3125  21.420     83.0   82.056747    92.308976
2010    669.542656  ...   1.1600  13.000     93.0  256.796344   388.725207
2011    706.967833  ...   1.5500  13.650    155.0  319.015032   510.919926
2012    476.060685  ...   6.2000  11.100     91.0  563.286154  1114.804739
2013    133.241233  ...   2.2000  20.600     71.0  529.767746  1148.299048
2014    300.863421  ...   1.5400   2.580      6.0  359.836667   378.741759


        min       25%      50%       75%      max
year
1989  40.57   40.5700   40.570   40.5700    40.57
1992    NaN       NaN      NaN       NaN      NaN
1994    NaN       NaN      NaN       NaN      NaN
1995  15.36   15.3600   15.360   15.3600    15.36
1996  12.53   13.6225   14.840   17.4825    21.41
1997  17.43   17.4300   17.430   17.4300    17.43
1998   4.70   19.7200   21.290   37.8800    47.92
1999  10.91   18.5650   29.760   40.4700    59.03
2000   3.22   18.0850   32.865   37.3400    80.00
2001  14.08   24.3375   33.650   42.2450    77.82
2002  12.53   32.2850   37.440   49.1450   121.36
2003  11.11   27.4600   35.955   46.2700   133.16
2004  10.23   35.5150   48.950   71.5000  2500.00
2005   4.70   20.9800   35.870   55.0400   300.30
2006   8.77   17.8825   46.940   89.6375  8500.00
2007   4.54   52.8300   80.580  148.0000  2000.00
2008   4.94   33.6300   56.070  123.9550   680.00
2009   8.52   35.9700   52.830  102.4450   550.00
2010   4.70   39.3900   90.000  343.0000  2700.00
2011   6.06   28.3200   87.870  312.3450  2250.00
2012   1.35   54.0150  200.000  462.5000  7720.00
2013   6.80   52.5550  132.000  511.5000  7560.00
2014  20.48  106.9050  272.000  433.0000  1056.00

[23 rows x 32 columns]

## Requirement 11

In [9]:
# Apply the describe() and unstack() methods to a planets.groupby() object

# Gives an idea of the time period that each method was used the most 
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.0
       Eclipse Timing Variations           9.0
       Imaging                            38.0
       Microlensing                       23.0
       Orbital Brightness Modulation       3.0
                                         ...
max    Pulsar Timing                    2011.0
       Pulsation Timing Variations      2007.0
       Radial Velocity                  2014.0
       Transit                          2014.0
       Transit Timing Variations        2014.0
Length: 80, dtype: float64

## Requirement 12

In [10]:
# Output the first ten rows from the Seaborn titanic dataset.

titanic = sns.load_dataset('titanic')
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

## Requirement 13

In [11]:
# Use the groupby() method with the titanic dataset to show mean survival rates by sex and class

titanic.groupby(['sex','class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

## Requirement 14

In [12]:
# Use the pivot_table() method with the titanic dataset to show mean survival rates by sex and class

titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

## Requirement 15

In [13]:
# Use a multi-level pivot table to include age with the previous requirement

age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

## Requirement 16

In [14]:
# Show row data by sex, and column data by class, aggregate survived by using sum, and fare by mean

titanic.pivot_table(index='sex', columns='class',aggfunc={'survived':sum, 'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

## Requirement 17

In [3]:
%matplotlib inline
import matplotlib.pyplot as plt, seaborn as sns, pandas as pd

sns.set()  # use Seaborn styles
states_cases = pd.read_csv('us-states-cases.csv')

FileNotFoundError: [Errno 2] File us-states-cases.csv does not exist: 'us-states-cases.csv'

## Requirement 18

In [16]:
# Create an np array x based on range(11). Output the cubed contents of x

x = np.array(range(11))
x ** 3

array([   0,    1,    8,   27,   64,  125,  216,  343,  512,  729, 1000],
      dtype=int32)

## Requirement 19

In [20]:
# Use list comprehension with a list of string to convert all entries to uppercase. 

cities = ['new york', 'london', 'tokyo', 'seoul']
[s.upper() for s in cities]

# What happens when the list contains the value of None? 
# - an AttributeError is thrown

['NEW YORK', 'LONDON', 'TOKYO', 'SEOUL']

## Requirement 20

In [21]:
# Convert the list from the previous requirement into a Pandas series.

p_cities = pd.Series(cities)

# Demonstrate conversion to uppercase with the Pandas series
p_cities.str.upper()

0    NEW YORK
1      LONDON
2       TOKYO
3       SEOUL
dtype: object

## Requirement 21

In [22]:
# Demonstrate the use of five Pandas str methods on a Pandas series named states 

import pandas as pd

states = pd.Series(['Texas','Florida','Georgia','South Dakota','New Hampshire'])
print ("uppercase:\n", states.str.upper())
print ("\nlowercase:\n", states.str.lower())
print ("\nlength:\n", states.str.len())
print ("\nends with A:\n", states.str.endswith('a'))
print ("\nsplit:\n", states.str.split())

uppercase:
 0            TEXAS
1          FLORIDA
2          GEORGIA
3     SOUTH DAKOTA
4    NEW HAMPSHIRE
dtype: object

lowercase:
 0            texas
1          florida
2          georgia
3     south dakota
4    new hampshire
dtype: object

length:
 0     5
1     7
2     7
3    12
4    13
dtype: int64

ends with A:
 0    False
1     True
2     True
3     True
4    False
dtype: bool

split:
 0             [Texas]
1           [Florida]
2           [Georgia]
3     [South, Dakota]
4    [New, Hampshire]
dtype: object

## Requirement 22

In [24]:
# Demonstrate the use of three regular expression examples using the states Pandas series.

print (states)
print ("\ntwo words:\n", states.str.match('([A-Za-z]+)\s'))
print ("\nends with consonant + A:\n", states.str.contains('[a-z][a]$'))
print ("\nnumber of vowels:\n", states.str.count('[a]|[e]|[o]|[u]|[i]'))

0            Texas
1          Florida
2          Georgia
3     South Dakota
4    New Hampshire
dtype: object

two words:
 0    False
1    False
2    False
3     True
4     True
dtype: bool

ends with consonant + A:
 0    False
1     True
2     True
3     True
4    False
dtype: bool

number of vowels:
 0    2
1    3
2    4
3    5
4    4
dtype: int64

## Requirement 23

In [25]:
# Demonstrate the use of three miscellaneous methods using the states Pandas series. 

print ("index:\n", states.str.get(0))
print ("join:\n", states.str.join('+'))
print ("concatenate:\n", states.str.cat())

index:
 0    T
1    F
2    G
3    S
4    N
dtype: object
join:
 0                    T+e+x+a+s
1                F+l+o+r+i+d+a
2                G+e+o+r+g+i+a
3      S+o+u+t+h+ +D+a+k+o+t+a
4    N+e+w+ +H+a+m+p+s+h+i+r+e
dtype: object
concatenate:
 TexasFloridaGeorgiaSouth DakotaNew Hampshire

## Requirement 24

##### Use markdown to describe the operations demonstrated in the section Example: Recipe Database in chapter 03.10.
1. Construct a string representation containing all JSON entries then load it in with pd.read_json
2. Get an idea of what the data looks like by doing: recipes.shape, recipes.iloc[0], and .describe() 
3. Gather information on certain types of recipes using regular expressions and vectorized string operations such as .contains()
4. Pick out recipes that satisfy certain requirements by generating a Boolean dataframe and querying from it.

## Requirement 25

In [26]:
# Create a NumPy date array using the date 01Jan2020.  Use the arange() method to create an array of seven dates

date = np.array('2020-01-01', dtype=np.datetime64)
print ("seven dates:", date +  np.arange(7))

seven dates: ['2020-01-01' '2020-01-02' '2020-01-03' '2020-01-04' '2020-01-05'
 '2020-01-06' '2020-01-07']

## Requirement 26

In [27]:
# Construct a Pandas series object and use it to demonstrate indexing data by timestamps.

dates = pd.DatetimeIndex(['2003-06-18', '2010-01-24',
                          '1968-07-13', '1970-06-12'])
birthdates = pd.Series(["Asha", "Ishan", "Pradeep", "Bhaswati"], index=dates)
birthdates

2003-06-18        Asha
2010-01-24       Ishan
1968-07-13     Pradeep
1970-06-12    Bhaswati
dtype: object

## Requirement 27

In [29]:
# Use a Pandas DataReader object to show the stock prices of a ticker symbol of your choice (e.g. MSFT, GS, TEAM) 

from pandas_datareader import data

msft = data.DataReader('MSFT', start='2020-01-01', end='2020-03-31', data_source='yahoo')
msft

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2020-01-02,160.729996,158.330002,158.779999,160.619995,22622100.0,159.737595
2020-01-03,159.949997,158.059998,158.320007,158.619995,21116200.0,157.748581
2020-01-06,159.100006,156.509995,157.080002,159.029999,20813700.0,158.156342
2020-01-07,159.669998,157.320007,159.320007,157.580002,21634100.0,156.714310
2020-01-08,160.800003,157.949997,158.929993,160.089996,27746500.0,159.210495
...,...,...,...,...,...,...
2020-03-25,154.330002,144.440002,148.910004,146.919998,75638200.0,146.511948
2020-03-26,156.660004,148.369995,148.399994,156.110001,64568100.0,155.676437
2020-03-27,154.889999,149.199997,151.750000,149.699997,57042300.0,149.284225
2020-03-30,160.600006,150.009995,152.440002,160.229996,63420300.0,159.784988
2020-03-31,164.779999,156.559998,159.399994,157.710007,77927200.0,157.271988

## Requirement 28

In [30]:
# Use the timeit function to compare processes summing four Pandas dataframe objects using:

df1, df2, df3, df4 = (pd.DataFrame(rng.randint(0, 1000, (100, 3))) for i in range(4))

# the typical approach (simple â€˜+â€™ operations)
%timeit df1 + df2 + df3 + df4

# the pd.eval() approach
%timeit pd.eval('df1 + df2 + df3 + df4')

3.35 ms Â± 81.3 Âµs per loop (mean Â± std. dev. of 7 runs, 100 loops each)
4.77 ms Â± 158 Âµs per loop (mean Â± std. dev. of 7 runs, 100 loops each)

## Requirement 29

*Watched videos*

## Requirement 30

Through completing Assignment 12 I learned various ways to search, manipulate, and reorganize pandas DataFrames and other data structures. I was previously confused on what exactly the purpose of RandomState was, so I was glad there was an exercise focused on RandomState in this assignment so that I could understand it a bit better. I am currently working on a data visualization project with a group of friends, and we are using COVID-19 and socioeconomic data from AWS Datasets. I hope to apply the techniques I learn in this course to help me work with that data.